Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: إلا موتتنا الأولى وما نحن بمعذبين
en: Except our first death, and we shall not be punished? (after we have entered Paradise)."

source: إن هذا لهو الفوز العظيم
en: Truly, this is the supreme success!

source: لمثل هذا فليعمل العاملون
en: For the like of this let the workers work.

source: أذلك خير نزلا أم شجرة الزقوم
en: Is that (Paradise) better entertainment or the tree of Zaqqum (a horrible tree in Hell)?

source: إنا جعلناها فتنة للظالمين
en: Truly We have made it (as) a trail for the Zalimun (polytheists, disbelievers, wrong-doers).

source: إنها شجرة تخرج في أصل الجحيم
en: Verily, it is a tree that springs out of the bottom of Hell-fire,

source: طلعها كأنه رءوس الشياطين
en: The shoots of its fruit-stalks are like the heads of Shayatin (devils);

source: فإنهم لآكلون منها فمالئون منها البطون
en: Truly, they will eat thereof and fill their bellies therewith.

source: ثم إن لهم عليها لشوبا من حميم
en: Then on the top of that they will be given boiling water to drink so that it becomes a mixture (of boiling water and Zaqqum in their bellies).

source: ثم إن مرجعهم لإلى الجحيم
en: Then thereafter, verily, their return is to the flaming fire of Hell.

source: إنهم ألفوا آباءهم ضالين
en: Verily, they found their fathers on the wrong path;

source: فهم على آثارهم يهرعون
en: So they (too) hastened in their footsteps!

source: ولقد ضل قبلهم أكثر الأولين
en: And indeed most of the men of old went astray before them;

source: ولقد أرسلنا فيهم منذرين
en: And indeed We sent among them warners (Messengers);

source: فانظر كيف كان عاقبة المنذرين
en: Then see what was the end of those who were warned (but heeded not).

source: ولقد نادانا نوح فلنعم المجيبون
en: And indeed Nuh (Noah) invoked Us, and We are the Best of those who answer (the request).

source: ونجيناه وأهله من الكرب العظيم
en: And We rescued him and his family from the great distress (i.e. drowning),

source: وجعلنا ذريته هم الباقين
en: And, his progeny, them We made the survivors (i.e. Shem, Ham and Japheth).

source: وتركنا عليه في الآخرين
en: And left for him (a goodly remembrance) among the later generations:

source: سلام على نوح في العالمين
en: "Salam (peace) be upon Nuh (Noah) (from Us) among the 'Alamin (mankind, jinn and all that exists)!"

source: إنا كذلك نجزي المحسنين
en: Verily, thus We reward the Muhsinun (good-doers - See V.2:112).

source: إنه من عبادنا المؤمنين
en: Verily, he [Nuh (Noah)] was one of Our believing slaves.

source: وإن من شيعته لإبراهيم
en: And, verily, among those who followed his [Nuh's (Noah)] way (Islamic Monotheism) was Ibrahim (Abraham).

source: إذ جاء ربه بقلب سليم
en: When he came to his Lord with a pure heart [attached to Allah Alone and none else, worshipping none but Allah Alone - true Islamic Monotheism, pure from the filth of polytheism].

source: إذ قال لأبيه وقومه ماذا تعبدون
en: When he said to his father and to his people: "What is it that which you worship?

source: أئفكا آلهة دون الله تريدون
en: "Is it a falsehood - alihah (gods) other than Allah - that you desire?

source: فما ظنكم برب العالمين
en: "Then what think you about the Lord of the 'Alamin (mankind, jinn, and all that exists)?"

source: فنظر نظرة في النجوم
en: Then he cast a glance at the stars,

source: فقال إني سقيم
en: And he said: "Verily, I am sick (with plague). [He did this trick to remain in their temple of idols to destroy them and not to accompany them to the pagan feast)]."

source: فتولوا عنه مدبرين
en: So they turned away from him, and departed (for fear of the disease).

source: فراغ إلى آلهتهم فقال ألا تأكلون
en: Then he turned to their alihah (gods) and said: "Will you not eat (of the offering before you)?

source: ما لكم لا تنطقون
en: "What is the matter with you that you speak not?"

source: فراغ عليهم ضربا باليمين
en: Then he turned upon them, striking (them) with (his) right hand.

source: فأقبلوا إليه يزفون
en: Then they (the worshippers of idols) came, towards him, hastening.

source: قال أتعبدون ما تنحتون
en: He said: "Worship you that which you (yourselves) carve?

source: والله خلقكم وما تعملون
en: "While Allah has created you and what you make!"

source: قالوا ابنوا له بنيانا فألقوه في الجحيم
en: They said: "Build for him a building (it is said that the building was like a furnace) and throw him into the blazing fire!"

source: فأرادوا به كيدا فجعلناهم الأسفلين
en: So they plotted a plot against him, but We made them the lowest.

source: وقال إني ذاهب إلى ربي سيهدين
en: And he said (after his rescue from the fire): "Verily, I am going to my Lord. He will guide me!"

source: رب هب لي من الصالحين
en: "My Lord! Grant me (offspring) from the righteous."

source: فبشرناه بغلام حليم
en: So We gave him the glad tidings of a forbearing boy.

source: فلما بلغ معه السعي قال يا بني إني أرى في المنام أني أذبحك فانظر ماذا ترى قال يا أبت افعل ما تؤمر ستجدني إن شاء الله من الصابرين
en: And, when he (his son) was old enough to walk with him, he said: "O my son! I have seen in a dream that I am slaughtering you (offering you in sacrifice to Allah). So look what you think!" He said: "O my father! Do that which you are commanded, Insha' Allah (if Allah wills), you shall find me of As-Sabirun (the patient)."

source: فلما أسلما وتله للجبين
en: Then, when they had both submitted themselves (to the Will of Allah), and he had laid him prostrate on his forehead (or on the side of his forehead for slaughtering);

source: وناديناه أن يا إبراهيم
en: We called out to him: "O Abraham!

source: قد صدقت الرؤيا إنا كذلك نجزي المحسنين
en: You have fulfilled the dream!" Verily thus do We reward the Muhsinun (good-doers - See 2:112).

source: إن هذا لهو البلاء المبين
en: Verily, that indeed was a manifest trial.

source: وفديناه بذبح عظيم
en: And We ransomed him with a great sacrifice (i.e. كبش - a ram);

source: سلام على إبراهيم
en: "Salam (peace) be upon Ibrahim (Abraham)!"

source: كذلك نجزي المحسنين
en: Thus indeed do We reward the Muhsinun (good-doers - See V.2:112).

source: وبشرناه بإسحاق نبيا من الصالحين
en: And We gave him the glad tidings of Ishaq (Isaac) - a Prophet from the righteous.

source: وباركنا عليه وعلى إسحاق ومن ذريتهما محسن وظالم لنفسه مبين
en: We blessed him and Ishaq (Isaac). And of their progeny are (some) that do right, and some that plainly wrong themselves.

source: ولقد مننا على موسى وهارون
en: And, indeed We gave Our Grace to Musa (Moses) and Harun (Aaron).

source: ونجيناهما وقومهما من الكرب العظيم
en: And We saved them and their people from the great distress,

source: ونصرناهم فكانوا هم الغالبين
en: And helped them, so that they became the victors;

source: وآتيناهما الكتاب المستبين
en: And We gave them the clear Scripture;

source: وهديناهما الصراط المستقيم
en: And guided them to the Right Path.

source: وتركنا عليهما في الآخرين
en: And We left for them (a goodly remembrance) among the later generations.

source: سلام على موسى وهارون
en: "Salam (peace) be upon Musa (Moses) and Harun (Aaron)!"

source: إنهما من عبادنا المؤمنين
en: Verily, they were two of Our believing slaves.

source: وإن إلياس لمن المرسلين
en: And verily, Iliyas (Elias) was one of the Messengers.

source: إذ قال لقومه ألا تتقون
en: When he said to his people: "Will you not fear Allah?

source: أتدعون بعلا وتذرون أحسن الخالقين
en: "Will you call upon Ba'l (a well known idol of his nation whom they used to worship) and forsake the Best of creators,

source: الله ربكم ورب آبائكم الأولين
en: "Allah, your Lord and the Lord of your forefathers?"

source: فكذبوه فإنهم لمحضرون
en: But they denied him [Iliyas (Elias)], so they will certainly be brought forth (to the punishment),

source: سلام على إل ياسين
en: "Salam (peace) be upon Ilyasin (Elias)!"

source: وإن لوطا لمن المرسلين
en: And verily, Lut (Lot) was one of the Messengers.

source: إذ نجيناه وأهله أجمعين
en: When We saved him and his family, all,

source: وإنكم لتمرون عليهم مصبحين
en: Verily, you pass by them in the morning

source: وبالليل أفلا تعقلون
en: And at night; will you not then reflect?

source: وإن يونس لمن المرسلين
en: And, verily, Yunus (Jonah) was one of the Messengers.

source: إذ أبق إلى الفلك المشحون
en: When he ran to the laden ship:

source: فساهم فكان من المدحضين
en: Then he (agreed to) cast lots, and he was among the losers.

source: فالتقمه الحوت وهو مليم
en: Then a (big) fish swallowed him as he had done an act worthy of blame.

source: فلولا أنه كان من المسبحين
en: Had he not been of them who glorify Allah,

source: للبث في بطنه إلى يوم يبعثون
en: He would have indeed remained inside its belly (the fish) till the Day of Resurrection.

source: فنبذناه بالعراء وهو سقيم
en: But We cast him forth on the naked shore while he was sick,

source: وأنبتنا عليه شجرة من يقطين
en: And We caused a plant of gourd to grow over him.

source: وأرسلناه إلى مائة ألف أو يزيدون
en: And We sent him to a hundred thousand (people) or even more.

source: فآمنوا فمتعناهم إلى حين
en: And they believed; so We gave them enjoyment for a while.

source: فاستفتهم ألربك البنات ولهم البنون
en: Now ask them (O Muhammad صلى الله عليه وسلم): "Are there (only) daughters for your Lord and sons for them?"

source: أم خلقنا الملائكة إناثا وهم شاهدون
en: Or did We create the angels female while they were witnesses?

source: ألا إنهم من إفكهم ليقولون
en: Verily, it is of their falsehood that they (Quraish pagans) say:

source: ولد الله وإنهم لكاذبون
en: "Allah has begotten [offspring - the angels being the daughters of Allah)?" And, verily, they are liars!

source: أصطفى البنات على البنين
en: Has He (then) chosen daughters rather than sons?

source: ما لكم كيف تحكمون
en: What is the matter with you? How do you decide?

source: أفلا تذكرون
en: Will you not then remember?

source: أم لكم سلطان مبين
en: Or is there for you a plain authority?

source: فأتوا بكتابكم إن كنتم صادقين
en: Then bring your Book if you are truthful!

source: وجعلوا بينه وبين الجنة نسبا ولقد علمت الجنة إنهم لمحضرون
en: And they have invented a kinship between Him and the jinn, but the jinn know well that they have indeed to appear (before Him) (i.e. they will be called to account).

source: سبحان الله عما يصفون
en: Glorified be Allah! (He is free) from what they attribute unto Him!

source: فإنكم وما تعبدون
en: So, verily you (pagans) and those whom you worship (idols)

source: ما أنتم عليه بفاتنين
en: Cannot lead astray [turn away from Him (Allah) anyone of the believers],

source: إلا من هو صال الجحيم
en: Except those who are predestined to burn in Hell!

source: وما منا إلا له مقام معلوم
en: And there is not one of us (angels) but has his known place (or position);

source: وإنا لنحن الصافون
en: And verily, we (angels), we stand in rows (for the prayers as you Muslims stand in rows for your prayers);

source: وإنا لنحن المسبحون
en: And verily, we (angels), indeed are those who glorify (Allah's Praises i.e. perform prayers).

source: وإن كانوا ليقولون
en: And indeed they (Arab pagans) used to say:

source: لو أن عندنا ذكرا من الأولين
en: "If we had a reminder as had the men of old (before the coming of Prophet Muhammad صلى الله عليه وسلم as a Messenger of Allah),

source: لكنا عباد الله المخلصين
en: "We would have indeed been the chosen slaves of Allah (true believers of Islamic Monotheism)!"

source: فكفروا به فسوف يعلمون
en: But (now that the Qur'an has come) they disbelieve therein (i.e. in the Qur'an and in Prophet Muhammad صلى الله عليه وسلم , and all that he brought, - the Divine Revelation), so they will come to know!

source: ولقد سبقت كلمتنا لعبادنا المرسلين
en: And, verily, Our Word has gone forth of old for Our slaves, the Messengers,

source: إنهم لهم المنصورون
en: That they verily would be made triumphant,

source: وإن جندنا لهم الغالبون
en: And that Our hosts! they verily would be the victors.

source: فتول عنهم حتى حين
en: So turn away (O Muhammad صلى الله عليه وسلم) from them for a while,

source: وأبصرهم فسوف يبصرون
en: And watch them and they shall see (the punishment)!

source: فإذا نزل بساحتهم فساء صباح المنذرين
en: Then, when it descends in their courtyard (i.e. near to them), evil will be the morning for those who had been warned!

source: وتول عنهم حتى حين
en: So turn (O Muhammad صلى الله عليه وسلم) away from them for a while,

source: وأبصر فسوف يبصرون
en: And watch and they shall see (the torment)!

source: سبحان ربك رب العزة عما يصفون
en: Glorified be your Lord, the Lord of Honour and Power! (He is free) from what they attribute unto Him!

source: وسلام على المرسلين
en: And peace be on the Messengers!

source: والحمد لله رب العالمين
en: And all the praises and thanks be to Allah, Lord of the 'Alamin (mankind, jinn and all that exists).

source: ص والقرآن ذي الذكر
en: Sad. [These letters (Sad, etc.) are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings]. By the Qur'an full of reminding (explanations and honour for the one who believes in it).

source: بل الذين كفروا في عزة وشقاق
en: Nay, those who disbelieve are in false pride and opposition.

source: كم أهلكنا من قبلهم من قرن فنادوا ولات حين مناص
en: How many a generation have We destroyed before them! And they cried out when there was no longer time for escape.

source: وعجبوا أن جاءهم منذر منهم وقال الكافرون هذا ساحر كذاب
en: And they (Arab pagans) wonder that a warner (Prophet Muhammad صلى الله عليه وسلم) has come to them from among themselves. And the disbelievers say: "This (Prophet Muhammad صلى الله عليه وسلم) is a sorcerer, a liar.

source: أجعل الآلهة إلها واحدا إن هذا لشيء عجاب
en: "Has he made the alihah (gods) (all) into One Ilah (God - Allah). Verily, this is a curious thing!"

source: وانطلق الملأ منهم أن امشوا واصبروا على آلهتكم إن هذا لشيء يراد
en: And the leaders among them went about (saying): "Go on, and remain constant to your alihah (gods)! Verily, this is a thing designed (against you)!

source: ما سمعنا بهذا في الملة الآخرة إن هذا إلا اختلاق
en: "We have not heard (the like) of this in the religion of these later days (i.e. Christianity). This is nothing but an invention! [Tafsir Al-Qurtubi]

source: أأنزل عليه الذكر من بيننا بل هم في شك من ذكري بل لما يذوقوا عذاب
en: "Has the Reminder been sent down to him (alone) from among us?" Nay, but they are in doubt about My Reminder (this Qur'an)! Nay, but they have not tasted (My) Torment!

source: أم عندهم خزائن رحمة ربك العزيز الوهاب
en: Or have they the treasures of the Mercy of your Lord, the All-Mighty, the Real Bestower?

source: أم لهم ملك السماوات والأرض وما بينهما فليرتقوا في الأسباب
en: Or is it that the dominion of the heavens and the earth and all that is between them is theirs? If so, let them ascend up with means (to the heavens)!

source: جند ما هنالك مهزوم من الأحزاب
en: (As they denied Allah's Message) they will be a defeated host like the Confederates of the old times (who were defeated).

source: كذبت قبلهم قوم نوح وعاد وفرعون ذو الأوتاد
en: Before them (were many who) belied (Messengers) - the people of Nuh (Noah); and 'Ad; and Fir'aun (Pharaoh) the man of stakes (with which he used to punish the people),

source: وثمود وقوم لوط وأصحاب الأيكة أولئك الأحزاب
en: And Thamud, and the people of Lut (Lot), and the Dwellers of the Wood: such were the Confederates.

source: إن كل إلا كذب الرسل فحق عقاب
en: Not one of them but belied the Messengers; therefore My Torment was justified,

source: وما ينظر هؤلاء إلا صيحة واحدة ما لها من فواق
en: And these only wait for a single Saihah [shout (i.e. the blowing of the Trumpet by the angel Israfil -)] there will be no pause or ending thereto [till everything will perish except Allah (the only God full of Majesty, Bounty and Honour)].

source: وقالوا ربنا عجل لنا قطنا قبل يوم الحساب
en: They say: "Our Lord! Hasten to us Qittana (i.e. our Record of good and bad deeds so that we may see it) before the Day of Reckoning!"

source: اصبر على ما يقولون واذكر عبدنا داوود ذا الأيد إنه أواب
en: Be patient (O Muhammad صلى الله عليه وسلم) of what they say, and remember Our slave Dawud (David), endued with power. Verily, he was ever oft-returning in all matters and in repentance (toward Allah).

source: إنا سخرنا الجبال معه يسبحن بالعشي والإشراق
en: Verily, We made the mountains to glorify Our Praises with him [Dawud (David)] in the 'Ashi (i.e. after the mid-day till sunset) and Ishraq (i.e. after the sunrise till mid-day).

source: والطير محشورة كل له أواب
en: And (so did) the birds assembled: all obedient to him [Dawud (David)] [i.e. they came and glorified Allah's Praises along with him]. (Tafsir Al-Qurtubi ).

source: وشددنا ملكه وآتيناه الحكمة وفصل الخطاب
en: We made his kingdom strong and gave him Al-Hikmah (Prophethood) and sound judgement in speech and decision.

source: وهل أتاك نبأ الخصم إذ تسوروا المحراب
en: And has the news of the litigants reached you? When they climbed over the wall into (his) Mihrab (a praying place or a private room);

source: إذ دخلوا على داوود ففزع منهم قالوا لا تخف خصمان بغى بعضنا على بعض فاحكم بيننا بالحق ولا تشطط واهدنا إلى سواء الصراط
en: When they entered in upon Dawud (David), he was terrified of them. They said: "Fear not! (We are) two litigants, one of whom has wronged the other, therefore judge between us with truth, and treat us not with injustice, and guide us to the Right Way.

source: إن هذا أخي له تسع وتسعون نعجة ولي نعجة واحدة فقال أكفلنيها وعزني في الخطاب
en: Verily, this my brother (in religion) has ninety-nine ewes, while I have (only) one ewe, and he says: "Hand it over to me, and he overpowered me in speech."

source: قال لقد ظلمك بسؤال نعجتك إلى نعاجه وإن كثيرا من الخلطاء ليبغي بعضهم على بعض إلا الذين آمنوا وعملوا الصالحات وقليل ما هم وظن داوود أنما فتناه فاستغفر ربه وخر راكعا وأناب
en: [Dawud (David)] said (immediately without listening to the opponent): "He has wronged you in demanding your ewe in addition to his ewes. And, verily, many partners oppress one another, except those who believe and do righteous good deeds, and they are few." And Dawud (David) guessed that We have tried him and he sought Forgiveness of his Lord, and he fell down prostrate and turned (to Allah) in repentance.

source: فغفرنا له ذلك وإن له عندنا لزلفى وحسن مآب
en: So We forgave him that, and verily, for him is a near access to Us, and a good place of (final) return (Paradise).

source: يا داوود إنا جعلناك خليفة في الأرض فاحكم بين الناس بالحق ولا تتبع الهوى فيضلك عن سبيل الله إن الذين يضلون عن سبيل الله لهم عذاب شديد بما نسوا يوم الحساب
en: O Dawud (David)! Verily! We have placed you as a successor on the earth; so judge you between men in truth (and justice) and follow not your desire - for it will mislead you from the Path of Allah. Verily, those who wander astray from the Path of Allah (shall) have a severe torment, because they forgot the Day of Reckoning.

source: وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار
en: And We created not the heaven and the earth and all that is between them without purpose! That is the consideration of those who disbelieve! Then woe to those who disbelieve (in Islamic Monotheism) from the Fire!

source: أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار
en: Shall We treat those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds as Mufsidun (those who associate partners in worship with Allah and commit crimes) on earth? Or shall We treat the Muttaqun (the pious - See V.2:2) as the Fujjar (criminals, disbelievers, the wicked)?

source: كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولو الألباب
en: (This is) a Book (the Qur'an) which We have sent down to you, full of blessings, that they may ponder over its Verses, and that men of understanding may remember.

source: ووهبنا لداوود سليمان نعم العبد إنه أواب
en: And to Dawud (David) We gave Sulaiman (Solomon). How excellent a slave! Verily, he was ever oft-returning in repentance (to Us)!

source: إذ عرض عليه بالعشي الصافنات الجياد
en: When there were displayed before him, in the afternoon, well trained horses of the highest breed [for Jihad (holy fighting in Allah's Cause)].

source: فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب
en: He said: "I did love the good (these horses) instead of remembering my Lord (in my 'Asr prayer)" till the time was over, and (the sun) had hidden in the veil (of night).

source: ردوها علي فطفق مسحا بالسوق والأعناق
en: Then he said "Bring them (horses) back to me." Then he began to pass his hand over their legs and their necks (till the end of the display).

source: ولقد فتنا سليمان وألقينا على كرسيه جسدا ثم أناب
en: And indeed, We did try Sulaiman (Solomon) and We placed on his throne Jasad (a devil, so he lost his kingdom for a while) and he did return (to Allah with obedience and in repentance, and to his throne and kingdom by the Grace of Allah).

source: قال رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي إنك أنت الوهاب
en: He said: "My Lord! Forgive me, and bestow upon me a kingdom such as shall not belong to any other after me: Verily, You are the Bestower."

source: فسخرنا له الريح تجري بأمره رخاء حيث أصاب
en: So, We subjected to him the wind; it blew gently by his order whithersoever he willed,

source: والشياطين كل بناء وغواص
en: And also the Shayatin (devils) from the jinn (including) every kind of builder and diver,

source: وآخرين مقرنين في الأصفاد
en: And also others bound in fetters.

source: هذا عطاؤنا فامنن أو أمسك بغير حساب
en: [Allah said to Sulaiman (Solomon)]: "This is Our gift: so spend you or withhold, no account will be asked (of you)."

source: وإن له عندنا لزلفى وحسن مآب
en: And verily, for him is a near access to Us, and a good (final) return (Paradise).

source: واذكر عبدنا أيوب إذ نادى ربه أني مسني الشيطان بنصب وعذاب
en: And remember Our slave Ayyub (Job), when he invoked his Lord (saying): "Verily Shaitan (Satan) has touched me with distress (by ruining my health) and torment (by ruining my wealth)!

source: اركض برجلك هذا مغتسل بارد وشراب
en: (Allah said to him): "Strike the ground with your foot: This is (a spring of) water to wash in, cool and a (refreshing) drink."

source: ووهبنا له أهله ومثلهم معهم رحمة منا وذكرى لأولي الألباب
en: And We gave him (back) his family, and along with them the like thereof, as a Mercy from Us, and a Reminder for those who understand.

source: وخذ بيدك ضغثا فاضرب به ولا تحنث إنا وجدناه صابرا نعم العبد إنه أواب
en: "And take in your hand a bundle of thin grass and strike therewith (your wife), and break not your oath. Truly! We found him patient. How excellent a slave! Verily he was ever oft-returning in repentance (to Us)!

source: واذكر عبادنا إبراهيم وإسحاق ويعقوب أولي الأيدي والأبصار
en: And remember Our slaves, Ibrahim (Abraham), Ishaq (Isaac), and Ya'qub (Jacob), (all) owners of strength (in worshipping Us) and (also) of religious understanding.

source: إنا أخلصناهم بخالصة ذكرى الدار
en: Verily, We did choose them by granting them (a good thing, - i.e.) the remembrance of the Home [in the Hereafter and they used to make the people remember it, and also they used to invite the people to obey Allah and to do good deeds for the Hereafter].

source: وإنهم عندنا لمن المصطفين الأخيار
en: And they are with Us, verily, of the chosen and the best!

source: واذكر إسماعيل واليسع وذا الكفل وكل من الأخيار
en: And remember Isma'il (Ishmael), Alyasa' (Elisha), and Dhul-Kifl (Isaiah), all are among the best.

source: هذا ذكر وإن للمتقين لحسن مآب
en: This is a Reminder. And verily, for the Muttaqun (the pious - See V.2:2) is a good final return (Paradise),

source: جنات عدن مفتحة لهم الأبواب
en: 'Adn (Eden) Paradise (everlasting Gardens), whose doors will be opened for them.

source: متكئين فيها يدعون فيها بفاكهة كثيرة وشراب
en: Therein they will recline; therein they will call for fruits in abundance and drinks;

source: وعندهم قاصرات الطرف أتراب
en: And beside them will be Qasirat-at-Tarf [chaste females (wives) restraining their glances (desiring none except their husbands)], (and) of equal ages.
